; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Planet23 - direction
	Star24 - direction
	Planet25 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star24)
	(supports instrument4 image1)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet23)
	(supports instrument7 infrared2)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 image1)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph0)
	(supports instrument9 image1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared2)
	(calibration_target instrument10 Star1)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet25)
)
(:goal (and
	(pointing satellite0 Phenomenon18)
	(pointing satellite1 Star19)
	(pointing satellite4 Planet20)
	(have_image Planet3 image1)
	(have_image Star4 image1)
	(have_image Planet5 image1)
	(have_image Planet6 infrared2)
	(have_image Star7 image1)
	(have_image Star8 infrared2)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Planet14 image1)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 image1)
	(have_image Planet17 image1)
	(have_image Star19 image1)
	(have_image Planet20 spectrograph0)
	(have_image Phenomenon21 infrared2)
	(have_image Star22 spectrograph0)
	(have_image Planet23 image1)
	(have_image Star24 infrared2)
	(have_image Planet25 infrared2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 25
2. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 25
3. (turn_to satellite4 planet20 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 planet20)
   goals met: 1 of 25
4. (turn_to satellite4 star1 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 star1)
   goals met: 0 of 25
5. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 25
6. (turn_to satellite4 phenomenon12 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 25
7. (take_image satellite4 phenomenon12 instrument10 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 1 of 25
8. (turn_to satellite4 phenomenon21 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon21)
   goals met: 1 of 25
9. (take_image satellite4 phenomenon21 instrument10 infrared2)
   added: (have_image phenomenon21 infrared2)
   goals met: 2 of 25
10. (turn_to satellite4 planet11 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 planet11)
   goals met: 2 of 25
11. (take_image satellite4 planet11 instrument10 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 3 of 25
12. (turn_to satellite4 planet13 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet13)
   goals met: 3 of 25
13. (take_image satellite4 planet13 instrument10 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 25
14. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 4 of 25
15. (take_image satellite4 planet15 instrument10 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 5 of 25
16. (turn_to satellite4 planet20 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet20)
   goals met: 6 of 25
17. (take_image satellite4 planet20 instrument10 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 7 of 25
18. (turn_to satellite3 star0 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star0)
   goals met: 7 of 25
19. (calibrate satellite3 instrument9 star0)
   added: (calibrated instrument9)
   goals met: 7 of 25
20. (turn_to satellite3 phenomenon16 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon16)
   goals met: 7 of 25
21. (take_image satellite3 phenomenon16 instrument9 image1)
   added: (have_image phenomenon16 image1)
   goals met: 8 of 25
22. (turn_to satellite3 planet10 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 planet10)
   goals met: 8 of 25
23. (take_image satellite3 planet10 instrument9 image1)
   added: (have_image planet10 image1)
   goals met: 9 of 25
24. (turn_to satellite3 planet14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet14)
   goals met: 9 of 25
25. (take_image satellite3 planet14 instrument9 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 25
26. (turn_to satellite3 planet17 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet17)
   goals met: 10 of 25
27. (take_image satellite3 planet17 instrument9 image1)
   added: (have_image planet17 image1)
   goals met: 11 of 25
28. (turn_to satellite3 planet23 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet23)
   goals met: 11 of 25
29. (take_image satellite3 planet23 instrument9 image1)
   added: (have_image planet23 image1)
   goals met: 12 of 25
30. (turn_to satellite3 planet3 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet3)
   goals met: 12 of 25
31. (take_image satellite3 planet3 instrument9 image1)
   added: (have_image planet3 image1)
   goals met: 13 of 25
32. (turn_to satellite3 planet5 planet3)
   deleted: (pointing satellite3 planet3)
   added: (pointing satellite3 planet5)
   goals met: 13 of 25
33. (take_image satellite3 planet5 instrument9 image1)
   added: (have_image planet5 image1)
   goals met: 14 of 25
34. (turn_to satellite3 star19 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star19)
   goals met: 14 of 25
35. (take_image satellite3 star19 instrument9 image1)
   added: (have_image star19 image1)
   goals met: 15 of 25
36. (turn_to satellite3 star4 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star4)
   goals met: 15 of 25
37. (take_image satellite3 star4 instrument9 image1)
   added: (have_image star4 image1)
   goals met: 16 of 25
38. (turn_to satellite3 star7 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star7)
   goals met: 16 of 25
39. (take_image satellite3 star7 instrument9 image1)
   added: (have_image star7 image1)
   goals met: 17 of 25
40. (turn_to satellite1 star19 star24)
   deleted: (pointing satellite1 star24)
   added: (pointing satellite1 star19)
   goals met: 18 of 25
41. (turn_to satellite0 phenomenon18 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon18)
   goals met: 19 of 25
42. (turn_to satellite4 planet25 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet25)
   goals met: 18 of 25
43. (take_image satellite4 planet25 instrument10 infrared2)
   added: (have_image planet25 infrared2)
   goals met: 19 of 25
44. (turn_to satellite4 planet20 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 planet20)
   goals met: 20 of 25
45. (turn_to satellite4 planet6 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet6)
   goals met: 19 of 25
46. (take_image satellite4 planet6 instrument10 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 20 of 25
47. (turn_to satellite4 planet20 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet20)
   goals met: 21 of 25
48. (turn_to satellite3 planet9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet9)
   goals met: 21 of 25
49. (take_image satellite3 planet9 instrument9 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 22 of 25
50. (turn_to satellite3 star22 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star22)
   goals met: 22 of 25
51. (take_image satellite3 star22 instrument9 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 23 of 25
52. (turn_to satellite3 star24 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 star24)
   goals met: 23 of 25
53. (take_image satellite3 star24 instrument9 infrared2)
   added: (have_image star24 infrared2)
   goals met: 24 of 25
54. (turn_to satellite4 star8 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 star8)
   goals met: 23 of 25
55. (take_image satellite4 star8 instrument10 infrared2)
   added: (have_image star8 infrared2)
   goals met: 24 of 25
56. (turn_to satellite4 planet20 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 planet20)
   goals met: 25 of 25
